/*************************************************************************
 * Copyright (c) 2022-2024, NVIDIA CORPORATION & AFFILIATES. All rights reserved.
 *
 * See LICENSE for license information.
 ************************************************************************/

#ifndef TRANSFORMER_ENGINE_COMMON_UTILS_CUH_
#define TRANSFORMER_ENGINE_COMMON_UTILS_CUH_

#include <sycl/sycl.hpp>
#include <dpct/dpct.hpp>

#if !defined(__CUDACC_RTC__)
#include <cstdint>
#else
// Importing C++ standard headers is a pain with NVRTC
using uint8_t = unsigned char;
using uint16_t = unsigned short int;  // NOLINT(*)
using uint32_t = unsigned int;
using uint64_t = unsigned long long int;  // NOLINT(*)
static_assert(sizeof(uint8_t) == 1);
static_assert(sizeof(uint16_t) == 2);
static_assert(sizeof(uint32_t) == 4);
static_assert(sizeof(uint64_t) == 8);
#endif

////////////////////////////////////////////////////////////////////////////////////////////////////

constexpr uint32_t THREADS_PER_WARP = 32;

////////////////////////////////////////////////////////////////////////////////////////////////////

/*
DPCT1011:219: The tool detected overloaded operators for built-in vector types,
which may conflict with the SYCL 2020 standard operators (see 4.14.2.1 Vec
interface). The tool inserted a namespace to avoid the conflict. Use SYCL 2020
standard operators instead.
*/
namespace dpct_operator_overloading {

inline sycl::float2 operator+(const sycl::float2 &a,
                              const sycl::float2 &b) { // NOLINT(*)
    return {a.x() + b.x(), a.y() + b.y()};
}
} // namespace dpct_operator_overloading

////////////////////////////////////////////////////////////////////////////////////////////////////

/*
DPCT1011:220: The tool detected overloaded operators for built-in vector types,
which may conflict with the SYCL 2020 standard operators (see 4.14.2.1 Vec
interface). The tool inserted a namespace to avoid the conflict. Use SYCL 2020
standard operators instead.
*/
namespace dpct_operator_overloading {

inline void operator+=(sycl::float2 &a, const sycl::float2 &b) { // NOLINT(*)
    a.x() += b.x();
    a.y() += b.y();
}
} // namespace dpct_operator_overloading

////////////////////////////////////////////////////////////////////////////////////////////////////

template<typename T>
struct Sum {
    inline Sum() {}
    inline T operator()(const T &a, const T &b) const {
        return dpct_operator_overloading::operator+(a, b);
    }
};

////////////////////////////////////////////////////////////////////////////////////////////////////

template<typename T>
inline T warp_shuffle_xor(const T & x, uint32_t idx,
                          const sycl::nd_item<3> &item_ct1) {
    return dpct::permute_sub_group_by_xor(item_ct1.get_sub_group(), x, idx);
}

template <>
inline sycl::float2
warp_shuffle_xor<sycl::float2>(const sycl::float2 &x, uint32_t idx,
                               const sycl::nd_item<3> &item_ct1) {
    return {warp_shuffle_xor(x.x(), idx, item_ct1),
            warp_shuffle_xor(x.y(), idx, item_ct1)};
}

template<typename T>
inline T warp_shuffle_down(const T & x, uint32_t idx,
                           const sycl::nd_item<3> &item_ct1) {
    /*
    DPCT1121:0: Make sure that the "x" which is used in the SYCL group
    function/algorithm is initialized.
    */
    return dpct::shift_sub_group_left(item_ct1.get_sub_group(), x, idx);
}

template <>
inline sycl::float2
warp_shuffle_down<sycl::float2>(const sycl::float2 &x, uint32_t idx,
                                const sycl::nd_item<3> &item_ct1) {
    return {warp_shuffle_down(x.x(), idx, item_ct1),
            warp_shuffle_down(x.y(), idx, item_ct1)};
}

////////////////////////////////////////////////////////////////////////////////////////////////////

namespace transformer_engine {

////////////////////////////////////////////////////////////////////////////////////////////////////

struct uint16 {
    sycl::uint4 u;
    sycl::uint4 v;
    sycl::uint4 s;
    sycl::uint4 t;
};

////////////////////////////////////////////////////////////////////////////////////////////////////

struct uint8 {
    sycl::uint4 u;
    sycl::uint4 v;
};

////////////////////////////////////////////////////////////////////////////////////////////////////

template<int BYTES>
struct BytesToType {};

template<>
struct BytesToType<64> {
    using Type = uint16;
    static_assert(sizeof(Type) == 64);
};

template<>
struct BytesToType<32> {
    using Type = uint8;
    static_assert(sizeof(Type) == 32);
};

template<>
struct BytesToType<16> {
    using Type = sycl::uint4;
    static_assert(sizeof(Type) == 16);
};

template<>
struct BytesToType<8> {
    using Type = uint64_t;
    static_assert(sizeof(Type) == 8);
};

template<>
struct BytesToType<4> {
    using Type = uint32_t;
    static_assert(sizeof(Type) == 4);
};

template<>
struct BytesToType<2> {
    using Type = uint16_t;
    static_assert(sizeof(Type) == 2);
};

template<>
struct BytesToType<1> {
    using Type = uint8_t;
    static_assert(sizeof(Type) == 1);
};

////////////////////////////////////////////////////////////////////////////////////////////////////

template<typename T>
struct TypeToVec2 {};

template<>
struct TypeToVec2<float> {
    using Type = sycl::float2;
};

template <> struct TypeToVec2<sycl::half> {
    using Type = sycl::half2;
};

template<>
struct TypeToVec2<nv_bfloat16> {
    using Type = nv_bfloat162;
};

////////////////////////////////////////////////////////////////////////////////////////////////////

template<int INDEX>
struct Get {
    template<typename T, typename R>
    static inline R of(const T &vec);
};

template<>
template<typename T, typename R>
inline R Get<0>::of(const T &vec) {
    return vec.x();
}

template<>
template<typename T, typename R>
inline R Get<1>::of(const T &vec) {
    return vec.y();
}

template<>
template<typename T, typename R>
inline R Get<2>::of(const T &vec) {
    return vec.z;
}

template<>
template<typename T, typename R>
